{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "name": "conv2d_1", "dtype": "float32", "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 50, 50, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 2], "name": "conv2d_2", "trainable": true, "padding": "valid", "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"units": 1, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential"}